Revit 2026 API

# IPointSetIterator Interface

---

An interface that Revit will call when iterating through sets of points on the engine.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IPointSetIterator
```
```vb
Public Interface IPointSetIterator
```
```cpp
public interface class IPointSetIterator
```
```fsharp
type IPointSetIterator = interface end
```

The IPointSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Free | Use this method to discard any resources consumed by the iterator. Revit will call it when done using the iterator. |
|  | ReadPoints | Implement this method to fill the provided buffer with points up to the number of maximum points for which the buffer was allocated. |

An instance of this interface is obtained from the Point Cloud engine when the engine's CreatePointSetIterator method is called.

#### Reference

Autodesk.Revit.DB.PointClouds Namespace